In [764]:
import pandas as pd
import numpy as np

In [765]:
p = pd.Series([1,2,3,4,5,6,67,8341,31])
p

0       1
1       2
2       3
3       4
4       5
5       6
6      67
7    8341
8      31
dtype: int64

In [766]:
type(p)

pandas.core.series.Series

In [767]:
p.axes

[RangeIndex(start=0, stop=9, step=1)]

In [768]:
p.dtype

dtype('int64')

In [769]:
p.ndim

1

In [770]:
p.values

array([   1,    2,    3,    4,    5,    6,   67, 8341,   31])

In [771]:
print(p)
print("boyut sayisi: " + str(p.ndim))
print("boyut bilgisi: " + str(p.shape))
print("toplam eleman sayisi: " + str(p.size))
print("array veri tipi: " + str(p.dtype))

0       1
1       2
2       3
3       4
4       5
5       6
6      67
7    8341
8      31
dtype: int64
boyut sayisi: 1
boyut bilgisi: (9,)
toplam eleman sayisi: 9
array veri tipi: int64

In [772]:
p.head(2) #ilk 2 eleman

0    1
1    2
dtype: int64

In [773]:
p.tail(2) #son 2 eleman

7    8341
8      31
dtype: int64

In [774]:
#index isimlendirme

In [775]:
a = pd.Series([99,22,33,44,556,66,777,889,9990,000], index=[1,3,5,7,9,11,13,15,17,19])
a

1       99
3       22
5       33
7       44
9      556
11      66
13     777
15     889
17    9990
19       0
dtype: int64

In [776]:
a.axes

[Index([1, 3, 5, 7, 9, 11, 13, 15, 17, 19], dtype='int64')]

In [777]:
a = pd.Series([99,22,33,44,556,66,777,889,9990,000], index=[1,"istanbul",5,7,9,11,"Ankara",15,17,19])
a

1             99
istanbul      22
5             33
7             44
9            556
11            66
Ankara       777
15           889
17          9990
19             0
dtype: int64

In [778]:
a["istanbul"]

np.int64(22)

In [779]:
a["istanbul":"Ankara"]

istanbul     22
5            33
7            44
9           556
11           66
Ankara      777
dtype: int64

## Sozluk ile liste olusturmak

In [780]:
sozluk = pd.Series({"aslan":31,"kaplan":26,"sirtlan":41})

In [781]:
sozluk

aslan      31
kaplan     26
sirtlan    41
dtype: int64

In [782]:
sozluk2 = {"aslan":31,"kaplan":26,"sirtlan":41}

In [783]:
seri = pd.Series(sozluk2)

In [784]:
seri

aslan      31
kaplan     26
sirtlan    41
dtype: int64

## iki seriyi birleştirerek seri oluşturma

In [785]:
pd.concat([seri,seri])

aslan      31
kaplan     26
sirtlan    41
aslan      31
kaplan     26
sirtlan    41
dtype: int64

## Eleman islemleri

In [786]:
a = np.array([1123,2133421,331531,4315315,53151355,6315135])
a

array([    1123,  2133421,   331531,  4315315, 53151355,  6315135])

In [787]:
seri = pd.Series(a)
seri

0        1123
1     2133421
2      331531
3     4315315
4    53151355
5     6315135
dtype: int64

In [788]:
seri[0]

np.int64(1123)

In [789]:
seri[0:3]

0       1123
1    2133421
2     331531
dtype: int64

In [790]:
seri = pd.Series([132,231,331,431,531],
                 index = ["zoro","tenyson","vilgax","venom","rimuru"])

In [791]:
seri

zoro       132
tenyson    231
vilgax     331
venom      431
rimuru     531
dtype: int64

In [792]:
seri.index

Index(['zoro', 'tenyson', 'vilgax', 'venom', 'rimuru'], dtype='object')

In [793]:
seri.keys

<bound method Series.keys of zoro       132
tenyson    231
vilgax     331
venom      431
rimuru     531
dtype: int64>

In [794]:
list(seri.items())

[('zoro', 132),
 ('tenyson', 231),
 ('vilgax', 331),
 ('venom', 431),
 ('rimuru', 531)]

In [795]:
seri.values

array([132, 231, 331, 431, 531])

# eleman sorgulama

In [796]:
"rimuru" in seri

True

In [797]:
"spiderman" in seri

False

In [798]:
seri["rimuru"]

np.int64(531)

# fancy eleman

In [799]:
seri[["venom","vilgax"]]

venom     431
vilgax    331
dtype: int64

In [800]:
seri["vilgax"] = 313131

In [801]:
seri["vilgax"]

np.int64(313131)

In [802]:
deger = seri["vilgax"]

In [803]:
print(deger)

313131

## PANDAS DataFrame Olusturma

In [804]:
l = [131,231,312412,4153135,543163456,61636]
l

[131, 231, 312412, 4153135, 543163456, 61636]

In [805]:
pd.DataFrame(l, columns= ["degisken_ismi"])

   degisken_ismi
0            131
1            231
2         312412
3        4153135
4      543163456
5          61636

In [806]:
m = np.arange(1,101).reshape((10,10))
m

array([[  1,   2,   3,   4,   5,   6,   7,   8,   9,  10],
       [ 11,  12,  13,  14,  15,  16,  17,  18,  19,  20],
       [ 21,  22,  23,  24,  25,  26,  27,  28,  29,  30],
       [ 31,  32,  33,  34,  35,  36,  37,  38,  39,  40],
       [ 41,  42,  43,  44,  45,  46,  47,  48,  49,  50],
       [ 51,  52,  53,  54,  55,  56,  57,  58,  59,  60],
       [ 61,  62,  63,  64,  65,  66,  67,  68,  69,  70],
       [ 71,  72,  73,  74,  75,  76,  77,  78,  79,  80],
       [ 81,  82,  83,  84,  85,  86,  87,  88,  89,  90],
       [ 91,  92,  93,  94,  95,  96,  97,  98,  99, 100]])

In [807]:
pd.DataFrame(m, columns=["var1","var2","var3","var4","var5","var6","var7","var8","var9","var10"], )

   var1  var2  var3  var4  var5  var6  var7  var8  var9  var10
0     1     2     3     4     5     6     7     8     9     10
1    11    12    13    14    15    16    17    18    19     20
2    21    22    23    24    25    26    27    28    29     30
3    31    32    33    34    35    36    37    38    39     40
4    41    42    43    44    45    46    47    48    49     50
5    51    52    53    54    55    56    57    58    59     60
6    61    62    63    64    65    66    67    68    69     70
7    71    72    73    74    75    76    77    78    79     80
8    81    82    83    84    85    86    87    88    89     90
9    91    92    93    94    95    96    97    98    99    100

# df (DataFrame) isimlendirme

In [808]:
df = pd.DataFrame(m, columns = ["var1","var2","var3","var4","var5","var6","var7","var8","var9","var10"])
df

   var1  var2  var3  var4  var5  var6  var7  var8  var9  var10
0     1     2     3     4     5     6     7     8     9     10
1    11    12    13    14    15    16    17    18    19     20
2    21    22    23    24    25    26    27    28    29     30
3    31    32    33    34    35    36    37    38    39     40
4    41    42    43    44    45    46    47    48    49     50
5    51    52    53    54    55    56    57    58    59     60
6    61    62    63    64    65    66    67    68    69     70
7    71    72    73    74    75    76    77    78    79     80
8    81    82    83    84    85    86    87    88    89     90
9    91    92    93    94    95    96    97    98    99    100

In [809]:
df.columns = ("a","b","c","d","e","f","g","h","i","j")
df

    a   b   c   d   e   f   g   h   i    j
0   1   2   3   4   5   6   7   8   9   10
1  11  12  13  14  15  16  17  18  19   20
2  21  22  23  24  25  26  27  28  29   30
3  31  32  33  34  35  36  37  38  39   40
4  41  42  43  44  45  46  47  48  49   50
5  51  52  53  54  55  56  57  58  59   60
6  61  62  63  64  65  66  67  68  69   70
7  71  72  73  74  75  76  77  78  79   80
8  81  82  83  84  85  86  87  88  89   90
9  91  92  93  94  95  96  97  98  99  100

In [810]:
print(df)
print("\n")
print("boyut sayisi: " + str(df.ndim))
print("\n")
print("boyut bilgisi: " + str(df.shape))
print("\n")
print("toplam eleman sayisi: " + str(df.size))
print("\n")
print("array veri tipi: " + str(df.dtypes))
print("\n")
print("array degerleri: " + str(df.values))
print("\n")
print("df.values'in veri tipi: "+ str(type(df.values)))

    a   b   c   d   e   f   g   h   i    j
0   1   2   3   4   5   6   7   8   9   10
1  11  12  13  14  15  16  17  18  19   20
2  21  22  23  24  25  26  27  28  29   30
3  31  32  33  34  35  36  37  38  39   40
4  41  42  43  44  45  46  47  48  49   50
5  51  52  53  54  55  56  57  58  59   60
6  61  62  63  64  65  66  67  68  69   70
7  71  72  73  74  75  76  77  78  79   80
8  81  82  83  84  85  86  87  88  89   90
9  91  92  93  94  95  96  97  98  99  100


boyut sayisi: 2


boyut bilgisi: (10, 10)


toplam eleman sayisi: 100


array veri tipi: a    int64
b    int64
c    int64
d    int64
e    int64
f    int64
g    int64
h    int64
i    int64
j    int64
dtype: object


array degerleri: [[  1   2   3   4   5   6   7   8   9  10]
 [ 11  12  13  14  15  16  17  18  19  20]
 [ 21  22  23  24  25  26  27  28  29  30]
 [ 31  32  33  34  35  36  37  38  39  40]
 [ 41  42  43  44  45  46  47  48  49  50]
 [ 51  52  53  54  55  56  57  58  59  60]
 [ 61  62  63  64  65  66  67  68  69  70]
 [ 71  72  73  74  75  76  77  78  79  80]
 [ 81  82  83  84  85  86  87  88  89  90]
 [ 91  92  93  94  95  96  97  98  99 100]]


df.values'in veri tipi: <class 'numpy.ndarray'>

In [811]:
a = np.array([1,2,3,4,54,56,5312])
a

array([   1,    2,    3,    4,   54,   56, 5312])

In [812]:
pd.DataFrame(a, columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4    54
5    56
6  5312

In [813]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [814]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([2, 2, 5, 3, 9], dtype=int32),
 'var2': array([2, 8, 4, 3, 4], dtype=int32),
 'var3': array([5, 8, 0, 3, 7], dtype=int32)}

In [815]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     2     2     5
1     2     8     8
2     5     4     0
3     3     3     3
4     9     4     7

In [816]:
df[0:1]

   var1  var2  var3
0     2     2     5

In [817]:
df[0:4:2]

   var1  var2  var3
0     2     2     5
2     5     4     0

In [818]:
df

   var1  var2  var3
0     2     2     5
1     2     8     8
2     5     4     0
3     3     3     3
4     9     4     7

In [819]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     2     2     5
b     2     8     8
c     5     4     0
d     3     3     3
e     9     4     7

# silme

In [820]:
df.drop("a", axis=0)

   var1  var2  var3
b     2     8     8
c     5     4     0
d     3     3     3
e     9     4     7

In [821]:
df

   var1  var2  var3
a     2     2     5
b     2     8     8
c     5     4     0
d     3     3     3
e     9     4     7

In [822]:
df.drop("a")

   var1  var2  var3
b     2     8     8
c     5     4     0
d     3     3     3
e     9     4     7

In [823]:
df.drop("c", axis = 0)

   var1  var2  var3
a     2     2     5
b     2     8     8
d     3     3     3
e     9     4     7

In [824]:
#kalıcı değiştirmek için df = .... veya bu fonksiyon;
df.drop("c", axis=0, inplace=True)

In [825]:
df

   var1  var2  var3
a     2     2     5
b     2     8     8
d     3     3     3
e     9     4     7

### fancy ile silme

In [826]:
l = ["b", "e"]

In [827]:
df.drop(l, axis=0, inplace=True)

In [828]:
df

   var1  var2  var3
a     2     2     5
d     3     3     3

In [829]:
"var1" in df

True

In [830]:
l = ["var1","var2","var3","var4"]

In [831]:
for i in l:
    print(i in df)

True
True
True
False

In [832]:
df["var1"]

a    2
d    3
Name: var1, dtype: int32

In [833]:
df["var4"] = df["var1"]/df["var2"]

In [834]:
df

   var1  var2  var3  var4
a     2     2     5   1.0
d     3     3     3   1.0

# degisken silme

In [835]:
df.drop("var4", axis=1)

   var1  var2  var3
a     2     2     5
d     3     3     3

In [836]:
df

   var1  var2  var3  var4
a     2     2     5   1.0
d     3     3     3   1.0

In [837]:
df.drop("var4", axis=1, inplace=True)

In [838]:
df

   var1  var2  var3
a     2     2     5
d     3     3     3

## GÖZLEM VE DEĞİŞKEN SEÇİMİ: loc & iloc

In [839]:
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0     7     4    13
1     9     6     2
2    28    17    19
3     1     9     7
4    14     1    17
5    28     7    21
6    29    20    14
7     4    14    24
8    20    15    16
9    21    28    15

loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [840]:
df.loc[0:3]

   var1  var2  var3
0     7     4    13
1     9     6     2
2    28    17    19
3     1     9     7

In [841]:
df.loc[6:8]

   var1  var2  var3
6    29    20    14
7     4    14    24
8    20    15    16

In [842]:
df.loc[5:3]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [843]:
df.iloc[0:3]

   var1  var2  var3
0     7     4    13
1     9     6     2
2    28    17    19

In [844]:
df.loc[0:3]

   var1  var2  var3
0     7     4    13
1     9     6     2
2    28    17    19
3     1     9     7

In [845]:
df.iloc[0,0]

np.int32(7)

In [846]:
df.iloc[:2,:3]

   var1  var2  var3
0     7     4    13
1     9     6     2

In [847]:
df.loc[0:3,"var3"]

0    13
1     2
2    19
3     7
Name: var3, dtype: int32

In [848]:
df.iloc[0:3]["var3"]

0    13
1     2
2    19
Name: var3, dtype: int32

# koşullu eleman

In [849]:
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    15    25    16
1    18    18    17
2     6     4    20
3     1    23    21
4     4    23    26
5    18     9     2
6    14     5    18
7    16    21    22
8    23     4    11
9    29    29    21

In [850]:
df["var1"]

0    15
1    18
2     6
3     1
4     4
5    18
6    14
7    16
8    23
9    29
Name: var1, dtype: int32

In [851]:
df["var1"][0:2]

0    15
1    18
Name: var1, dtype: int32

In [852]:
df[0:2]

   var1  var2  var3
0    15    25    16
1    18    18    17

In [853]:
df[0:2]["var1"]

0    15
1    18
Name: var1, dtype: int32

In [854]:
df[0:2][["var1","var2"]]

   var1  var2
0    15    25
1    18    18

In [855]:
df

   var1  var2  var3
0    15    25    16
1    18    18    17
2     6     4    20
3     1    23    21
4     4    23    26
5    18     9     2
6    14     5    18
7    16    21    22
8    23     4    11
9    29    29    21

In [856]:
df.var1

0    15
1    18
2     6
3     1
4     4
5    18
6    14
7    16
8    23
9    29
Name: var1, dtype: int32

In [857]:
df[df.var1 > 15]

   var1  var2  var3
1    18    18    17
5    18     9     2
7    16    21    22
8    23     4    11
9    29    29    21

In [858]:
df[df.var1 > 15]["var1"]

1    18
5    18
7    16
8    23
9    29
Name: var1, dtype: int32

In [859]:
df[(df.var1 > 15) & (df.var3 < 8)]

   var1  var2  var3
5    18     9     2

In [860]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    18    18
5    18     9
7    16    21
8    23     4
9    29    29

In [861]:
df[(df.var1 > 15)]["var1"]

1    18
5    18
7    16
8    23
9    29
Name: var1, dtype: int32

In [862]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    18    18
5    18     9
7    16    21
8    23     4
9    29    29

# Birleştirme (Join) İşlemleri

In [863]:
m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m, columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    10     6    28
1    27    29     7
2     6    21    25
3    15    18    19
4    28    12    15

In [864]:
df2 = df1 + 31
df2

   var1  var2  var3
0    41    37    59
1    58    60    38
2    37    52    56
3    46    49    50
4    59    43    46

In [865]:
pd.concat([df1,df2]) # indexlerde sıkıntı var çözelim.

   var1  var2  var3
0    10     6    28
1    27    29     7
2     6    21    25
3    15    18    19
4    28    12    15
0    41    37    59
1    58    60    38
2    37    52    56
3    46    49    50
4    59    43    46

In [866]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    10     6    28
1    27    29     7
2     6    21    25
3    15    18    19
4    28    12    15
5    41    37    59
6    58    60    38
7    37    52    56
8    46    49    50
9    59    43    46

In [867]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [868]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [869]:
df2.columns = ["var1","var2","deg3"]

In [870]:
df2

   var1  var2  deg3
0    41    37    59
1    58    60    38
2    37    52    56
3    46    49    50
4    59    43    46

In [871]:
df1

   var1  var2  var3
0    10     6    28
1    27    29     7
2     6    21    25
3    15    18    19
4    28    12    15

In [872]:
pd.concat([df1, df2]) #nan'ları istemiyorsak;

   var1  var2  var3  deg3
0    10     6  28.0   NaN
1    27    29   7.0   NaN
2     6    21  25.0   NaN
3    15    18  19.0   NaN
4    28    12  15.0   NaN
0    41    37   NaN  59.0
1    58    60   NaN  38.0
2    37    52   NaN  56.0
3    46    49   NaN  50.0
4    59    43   NaN  46.0

In [873]:
pd.concat([df1, df2], join="inner")

   var1  var2
0    10     6
1    27    29
2     6    21
3    15    18
4    28    12
0    41    37
1    58    60
2    37    52
3    46    49
4    59    43

In [874]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\giray\appdata\local\programs\python\python312\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [875]:
pd.concat([df1, df2], axis=1, join="outer")

   var1  var2  var3  var1  var2  deg3
0    10     6    28    41    37    59
1    27    29     7    58    60    38
2     6    21    25    37    52    56
3    15    18    19    46    49    50
4    28    12    15    59    43    46

In [876]:
df_combined = pd.concat([df1, df2], axis=0, ignore_index=False)
df_combined

   var1  var2  var3  deg3
0    10     6  28.0   NaN
1    27    29   7.0   NaN
2     6    21  25.0   NaN
3    15    18  19.0   NaN
4    28    12  15.0   NaN
0    41    37   NaN  59.0
1    58    60   NaN  38.0
2    37    52   NaN  56.0
3    46    49   NaN  50.0
4    59    43   NaN  46.0

In [877]:
df_combined = df_combined.reindex(columns=["var1", "var2", "var3"])
df_combined

   var1  var2  var3
0    10     6  28.0
1    27    29   7.0
2     6    21  25.0
3    15    18  19.0
4    28    12  15.0
0    41    37   NaN
1    58    60   NaN
2    37    52   NaN
3    46    49   NaN
4    59    43   NaN

# ileri birleştirme

In [878]:
df1 = pd.DataFrame({'Calisanlar' : ['Giray','Ayse', 'Veli', 'Mehmet'],
                    'Grup'       : ['Muhendislik', 'Muhasebe', 'IK', 'Muhendislik']
                    })
df1

  Calisanlar         Grup
0      Giray  Muhendislik
1       Ayse     Muhasebe
2       Veli           IK
3     Mehmet  Muhendislik

In [879]:
df2 = pd.DataFrame({'Calisanlar' : ['Giray','Ayse', 'Veli', 'Mehmet'],
                    'ilk_giris'       : [2010, 2009, 2014, 2019]
                    })
df2

  Calisanlar  ilk_giris
0      Giray       2010
1       Ayse       2009
2       Veli       2014
3     Mehmet       2019

In [880]:
pd.merge(df1,df2)

  Calisanlar         Grup  ilk_giris
0      Giray  Muhendislik       2010
1       Ayse     Muhasebe       2009
2       Veli           IK       2014
3     Mehmet  Muhendislik       2019

In [881]:
pd.merge(df1,df2, on = "Calisanlar")

  Calisanlar         Grup  ilk_giris
0      Giray  Muhendislik       2010
1       Ayse     Muhasebe       2009
2       Veli           IK       2014
3     Mehmet  Muhendislik       2019

## many to one

In [882]:
df3 = pd.merge(df1,df2)
df3

  Calisanlar         Grup  ilk_giris
0      Giray  Muhendislik       2010
1       Ayse     Muhasebe       2009
2       Veli           IK       2014
3     Mehmet  Muhendislik       2019

In [883]:
df4 = pd.DataFrame({'Grup'  : ['Muhasebe','Muhendislik','IK'],
                    'Mudur' : ['Caner','Mustafa','Berkcan']
                    })
df4

          Grup    Mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [884]:
pd.merge(df3,df4)

  Calisanlar         Grup  ilk_giris    Mudur
0      Giray  Muhendislik       2010  Mustafa
1       Ayse     Muhasebe       2009    Caner
2       Veli           IK       2014  Berkcan
3     Mehmet  Muhendislik       2019  Mustafa

## Many to Many

In [885]:
df5 = pd.DataFrame({'Grup'       : ['Muhasebe','Muhasebe','Muhendislik','Muhendislik','IK','IK'],
                    'Yetenekler' : ['matematik','excel','kodlama','linux','excel','yonetim']
                    })
df5

          Grup Yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [886]:
df1

  Calisanlar         Grup
0      Giray  Muhendislik
1       Ayse     Muhasebe
2       Veli           IK
3     Mehmet  Muhendislik

In [887]:
pd.merge(df1,df5)

  Calisanlar         Grup Yetenekler
0      Giray  Muhendislik    kodlama
1      Giray  Muhendislik      linux
2       Ayse     Muhasebe  matematik
3       Ayse     Muhasebe      excel
4       Veli           IK      excel
5       Veli           IK    yonetim
6     Mehmet  Muhendislik    kodlama
7     Mehmet  Muhendislik      linux

# TOPLULAŞTIRMA VE GRUPLAMA ( AGGREGATION & GROUPING )

basic aggregation functions:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [888]:
import seaborn as sns

In [889]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [890]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\giray\appdata\local\programs\python\python312\lib\site-packages\seaborn\utils.py
Type:      function

In [891]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [892]:
df.shape

(1035, 6)

In [893]:
df.mean(numeric_only=True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [894]:
df["mass"].mean()

np.float64(2.6381605847953216)

In [895]:
df["mass"].count()

np.int64(513)

In [896]:
df["mass"].min()

np.float64(0.0036)

In [897]:
df["mass"].max()

np.float64(25.0)

In [898]:
df["mass"].sum()

np.float64(1353.37638)

In [899]:
df["mass"].std()

np.float64(3.8186166509616046)

In [900]:
df["mass"].var()

np.float64(14.58183312700122)

In [901]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [902]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [903]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

Grouping

In [904]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C',],
                   'veri'    : [10,124,321,31,8,45]}, columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B   124
2       C   321
3       A    31
4       B     8
5       C    45

In [905]:
df.groupby('gruplar') #aggregation fonksiyonu lazım

In [906]:
df.groupby('gruplar').mean()

          veri
gruplar
A         20.5
B         66.0
C        183.0

In [907]:
df.groupby('gruplar').sum()

         veri
gruplar
A          41
B         132
C         366

In [908]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [909]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [910]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

İLERİ TOPLULAŞTIRMA İŞLEMLERİ
* Aggregate
* Filter
* transform
* apply

In [911]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C',],
                   'degisken1'    : [10,12,31,12,86,99],
                   'degisken2'    : [20,134,321,313,831,102]}, 
                    columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10         20
1       B         12        134
2       C         31        321
3       A         12        313
4       B         86        831
5       C         99        102

* aggregate

In [912]:
df.groupby('gruplar').mean()

         degisken1  degisken2
gruplar
A             11.0      166.5
B             49.0      482.5
C             65.0      211.5

In [913]:
df.groupby('gruplar').aggregate([min, np.median, max])

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\131899679.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('gruplar').aggregate([min, np.median, max])
C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\131899679.py:1: FutureWarning: The provided callable <function median at 0x000001877F5C14E0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('gruplar').aggregate([min, np.median, max])
C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\131899679.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('gruplar').aggregate([min, np.median, max])
C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\131899679.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('gruplar').aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   11.0  12        20  166.5  313
B              12   49.0  86       134  482.5  831
C              31   65.0  99       102  211.5  321

In [914]:
df.groupby('gruplar').aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        313
B               12        831
C               31        321

In [915]:
df.groupby('gruplar').aggregate({"degisken1": min, "degisken2": max})

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\959558529.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('gruplar').aggregate({"degisken1": min, "degisken2": max})
C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\959558529.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('gruplar').aggregate({"degisken1": min, "degisken2": max})

         degisken1  degisken2
gruplar
A               10        313
B               12        831
C               31        321

* filter

In [916]:
df

  gruplar  degisken1  degisken2
0       A         10         20
1       B         12        134
2       C         31        321
3       A         12        313
4       B         86        831
5       C         99        102

In [917]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [918]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         1.414214  207.182287
B        52.325902  492.853426
C        48.083261  154.856385

In [919]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
1       B         12        134
2       C         31        321
4       B         86        831
5       C         99        102

* transform

In [920]:
df

  gruplar  degisken1  degisken2
0       A         10         20
1       B         12        134
2       C         31        321
3       A         12        313
4       B         86        831
5       C         99        102

In [921]:
df["degisken1"]*9

0     90
1    108
2    279
3    108
4    774
5    891
Name: degisken1, dtype: int64

In [922]:
df_a = df.iloc[:,1:3]
df_a

   degisken1  degisken2
0         10         20
1         12        134
2         31        321
3         12        313
4         86        831
5         99        102

In [923]:
df_a.transform(lambda x: x-x.mean())

   degisken1   degisken2
0 -31.666667 -266.833333
1 -29.666667 -152.833333
2 -10.666667   34.166667
3 -29.666667   26.166667
4  44.333333  544.166667
5  57.333333 -184.833333

In [924]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -0.785344  -0.913416
1  -0.735743  -0.523174
2  -0.264537   0.116958
3  -0.735743   0.089573
4   1.099481   1.862774
5   1.421886  -0.632716

* apply

In [925]:
df = pd.DataFrame({'degisken1'    : [10,12,31,12,86,99],
                   'degisken2'    : [20,134,321,313,831,102]}, 
                    columns=['degisken1','degisken2'])
df

   degisken1  degisken2
0         10         20
1         12        134
2         31        321
3         12        313
4         86        831
5         99        102

In [926]:
df.apply(np.sum)

degisken1     250
degisken2    1721
dtype: int64

In [927]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C',],
                   'degisken1'    : [10,12,31,12,86,99],
                   'degisken2'    : [20,134,321,313,831,102]}, 
                    columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10         20
1       B         12        134
2       C         31        321
3       A         12        313
4       B         86        831
5       C         99        102

In [928]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       250
degisken2      1721
dtype: object

In [929]:
df.groupby("gruplar").apply(np.sum)

c:\Users\Giray\AppData\Local\Programs\Python\Python312\Lib\site-packages\numpy\_core\fromnumeric.py:84: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
c:\Users\Giray\AppData\Local\Programs\Python\Python312\Lib\site-packages\numpy\_core\fromnumeric.py:84: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
c:\Users\Giray\AppData\Local\Programs\Python\Python312\Lib\site-packages\numpy\_core\fromnumeric.py:84: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\2155945059.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         22        333
B            BB         98        965
C            CC        130        423

In [930]:
df.groupby("gruplar").apply(np.mean)

gruplar
A     88.75
B    265.75
C    138.25
dtype: float64

# pivot tables

In [931]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [932]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [933]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [934]:
titanic.groupby('sex')[['survived']].sum()

        survived
sex
female       233
male         109

In [935]:
titanic.groupby('sex')['survived'].describe()

        count      mean       std  min  25%  50%  75%  max
sex
female  314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male    577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [936]:
titanic.groupby(["sex","class"])[['survived']].aggregate("mean").unstack()

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\1153637136.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"])[['survived']].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [937]:
titanic.groupby(["sex","class"])[['survived']].aggregate("mean")

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\1189174913.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"])[['survived']].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [938]:
titanic.groupby(["sex","class","alone"])[['survived']].aggregate("mean").unstack()

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\2704630183.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class","alone"])[['survived']].aggregate("mean").unstack()

               survived
alone             False     True
sex    class
female First   0.966667  0.970588
       Second  0.931818  0.906250
       Third   0.416667  0.616667
male   First   0.425532  0.333333
       Second  0.277778  0.097222
       Third   0.180723  0.121212

pivot ile pivot table

In [939]:
titanic.pivot_table("survived", index="sex", columns="class")

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\774227978.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [940]:
titanic.groupby(["sex","class"])[['survived']].aggregate("mean").unstack()

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\1153637136.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"])[['survived']].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [941]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [942]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(20)

0     (18.0, 90.0]
1     (18.0, 90.0]
2     (18.0, 90.0]
3     (18.0, 90.0]
4     (18.0, 90.0]
5              NaN
6     (18.0, 90.0]
7      (0.0, 18.0]
8     (18.0, 90.0]
9      (0.0, 18.0]
10     (0.0, 18.0]
11    (18.0, 90.0]
12    (18.0, 90.0]
13    (18.0, 90.0]
14     (0.0, 18.0]
15    (18.0, 90.0]
16     (0.0, 18.0]
17             NaN
18    (18.0, 90.0]
19             NaN
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [943]:
titanic.pivot_table("survived", ["sex",age], "class")

C:\Users\Giray\AppData\Local\Temp\ipykernel_10472\2298594095.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış kaynaklı veri okuma işlemleri

In [944]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv", sep= ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [945]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols: 'UsecolsArgType' = None,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters: 'Mapping[Hashable, Callable] | None' = None,
    true_values: 'list | None' = None,
    false_values: 'list | None' = None,
    skipinitialspace: 'bool' = False,
    skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values: 'Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None' = None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool | lib.NoDefault' = <no_default>,
    skip_blank_lines: 'bool' = True,
    parse_dates: 'bool | Sequence[Hashable] | None' = None,
    infer_datetime_format: 'bool | lib.NoDefault' = <no_default>,
    keep_date_col: 'bool | lib.NoDefault' = <no_default>,
    date_parser: 'Callable | lib.NoDefault' = <no_default>,
    date_format: 'str | dict[Hashable, str] | None' = None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    on_bad_lines: 'str' = 'error',
    delim_whitespace: 'bool | lib.NoDefault' = <no_default>,
    low_memory: 'bool' = True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions | None' = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
) -> 'DataFrame | TextFileReader'
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Character or regex pattern to treat as the delimiter. If ``sep=None``, the
    C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator from only the first valid
    row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
    In addition, separators longer than 1 character and different from
    ``'\s+'`` will be interpreted as regular expressions and will also force
    the use of the Python parsing engine. Note that regex delimiters are prone
    to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, optional
    Alias for ``sep``.
header : int, Sequence of int, 'infer' or None, default 'infer'
    Row number(s) containing column labels and marking the start of the
    data (zero-indexed). Default behavior is to infer the column names: if no ``names``
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly to ``names`` then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a :class:`~pandas.MultiIndex` on the columns
    e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : Sequence of Hashable, optional
    Sequence of column labels to apply. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : Hashable, Sequence of Hashable or False, optional
  Column(s) to use as row label(s), denoted either by column labels or column
  indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
  will be formed for the row labels.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g., when you have a malformed file with delimiters at
  the end of each line.
usecols : Sequence of Hashable or Callable, optional
    Subset of columns to select, denoted either by column labels or column indices.
    If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in ``names`` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
    preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
    for columns in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to ``True``. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
dtype : dtype or dict of {Hashable : dtype}, optional
    Data type(s) to apply to either the whole dataset or individual columns.
    E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
    Use ``str`` or ``object`` together with suitable ``na_values`` settings
    to preserve and not interpret ``dtype``.
    If ``converters`` are specified, they will be applied INSTEAD
    of ``dtype`` conversion.

    .. versionadded:: 1.5.0

        Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
        the default determines the ``dtype`` of the columns which are not explicitly
        listed.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The 'pyarrow' engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict of {Hashable : Callable}, optional
    Functions for converting values in specified columns. Keys can either
    be column labels or column indices.
true_values : list, optional
    Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
false_values : list, optional
    Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : int, list of int or Callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (``int``)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
    Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
    per-column ``NA`` values.  By default the following values are interpreted as
    ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
    "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
    "n/a", "nan", "null ".

keep_default_na : bool, default True
    Whether or not to include the default ``NaN`` values when parsing the data.
    Depending on whether ``na_values`` is passed in, the behavior is as follows:

    * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
      is appended to the default ``NaN`` values used for parsing.
    * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
      the default ``NaN`` values are used for parsing.
    * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
      the ``NaN`` values specified ``na_values`` are used for parsing.
    * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
      strings will be parsed as ``NaN``.

    Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
    ``na_values`` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of ``na_values``). In
    data without any ``NA`` values, passing ``na_filter=False`` can improve the
    performance of reading a large file.
verbose : bool, default False
    Indicate number of ``NA`` values placed in non-numeric columns.

    .. deprecated:: 2.2.0
skip_blank_lines : bool, default True
    If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
    The behavior is as follows:

    * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
      ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
    * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
      each as a separate date column.
    * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
      as a single date column. Values are joined with a space before parsing.
    * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
      result 'foo'. Values are joined with a space before parsing.

    If a column or index cannot be represented as an array of ``datetime``,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an ``object`` data type. For
    non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
    :func:`~pandas.read_csv`.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
    format of the ``datetime`` strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.

    .. deprecated:: 2.0.0
        A strict version of this argument is now the default, passing it has no effect.

keep_date_col : bool, default False
    If ``True`` and ``parse_dates`` specifies combining multiple columns then
    keep the original columns.
date_parser : Callable, optional
    Function to use for converting a sequence of string columns to an array of
    ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. pandas will try to call ``date_parser`` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by ``parse_dates`` into a single array
    and pass that; and 3) call ``date_parser`` once for each row using one or
    more strings (corresponding to the columns defined by ``parse_dates``) as
    arguments.

    .. deprecated:: 2.0.0
       Use ``date_format`` instead, or read in as ``object`` and then apply
       :func:`~pandas.to_datetime` as-needed.
date_format : str or dict of column -> format, optional
    Format to use for parsing dates when used in conjunction with ``parse_dates``.
    The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
    `strftime documentation
    <https://docs.python.org/3/library/datetime.html
    #strftime-and-strptime-behavior>`_ for more information on choices, though
    note that :const:`"%f"` will parse all the way up to nanoseconds.
    You can also pass:

    - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
        time string (not necessarily in exactly the same format);
    - "mixed", to infer the format for each element individually. This is risky,
        and you should probably use it along with `dayfirst`.

    .. versionadded:: 2.0.0
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If ``True``, use a cache of unique, converted dates to apply the ``datetime``
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

iterator : bool, default False
    Return ``TextFileReader`` object for iteration or getting chunks with
    ``get_chunk()``.
chunksize : int, optional
    Number of lines to read from the file per chunk. Passing a value will cause the
    function to return a ``TextFileReader`` object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
    other key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    .. versionadded:: 1.5.0
        Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str (length 1), optional
    Character acting as the thousands separator in numerical values.
decimal : str (length 1), default '.'
    Character to recognize as decimal point (e.g., use ',' for European data).
lineterminator : str (length 1), optional
    Character used to denote a line break. Only valid with C parser.
quotechar : str (length 1), optional
    Character used to denote the start and end of a quoted item. Quoted
    items can include the ``delimiter`` and it will be ignored.
quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
    ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
    characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
    or ``lineterminator``.
doublequote : bool, default True
   When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    Character used to escape other characters.
comment : str (length 1), optional
    Character indicating that the remainder of line should not be parsed.
    If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter ``header`` but not by
    ``skiprows``. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
    treated as the header.
encoding : str, optional, default 'utf-8'
    Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

encoding_errors : str, optional, default 'strict'
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
    ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
    override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
    documentation for more details.
on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

    - ``'error'``, raise an Exception when a bad line is encountered.
    - ``'warn'``, raise a warning when a bad line is encountered and skip that line.
    - ``'skip'``, skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - Callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new ``list`` of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine='python'``

    .. versionchanged:: 2.2.0

        - Callable, function with signature
          as described in `pyarrow documentation
          <https://arrow.apache.org/docs/python/generated/pyarrow.csv.ParseOptions.html
          #pyarrow.csv.ParseOptions.invalid_row_handler>`_ when ``engine='pyarrow'``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'\t'``) will be

In [946]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [947]:
#excel
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [948]:
df = pd.read_excel("reading_data/ornekx.xlsx")
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [949]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [950]:
df.columns = ("A","B","C")
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [951]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [952]:
df.var1

0    16
1    28
2     4
3    14
4     7
5    15
6    23
7     8
8     2
9    19
Name: var1, dtype: int32

In [953]:
df["var1"]

0    16
1    28
2     4
3    14
4     7
5    15
6    23
7     8
8     2
9    19
Name: var1, dtype: int32

In [954]:
df.values

array([[16,  2, 29],
       [28, 14, 29],
       [ 4, 16,  1],
       [14, 26, 21],
       [ 7,  6, 24],
       [15,  4, 22],
       [23,  8,  6],
       [ 8,  2, 25],
       [ 2,  3, 12],
       [19, 10,  8]], dtype=int32)

In [956]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C',],
                   'degisken1'    : [10,12,31,12,86,99],
                   'degisken2'    : [20,134,321,313,831,102]}, 
                    columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10         20
1       B         12        134
2       C         31        321
3       A         12        313
4       B         86        831
5       C         99        102

In [958]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             11.0      166.5
B             49.0      482.5
C             65.0      211.5

In [959]:
seri = pd.Series([121,200,150,99])

seri.values

array([121, 200, 150,  99])